go_bench.txt
Running 10s test @ http://localhost:8082/api/articles
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   247.90ms  218.27ms   1.79s    77.39%
    Req/Sec   113.84     37.79   230.00     70.71%
  4557 requests in 10.07s, 46.96MB read
Requests/sec:    452.37
Transfer/sec:      4.66MB