go_pg_bench.txt
Running 10s test @ http://localhost:8082/api/articles
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   720.94ms  505.77ms   1.99s    65.32%
    Req/Sec    21.09     11.49    70.00     66.96%
  804 requests in 10.03s, 8.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 135
Requests/sec:     80.12
Transfer/sec:    824.53KB