rust_pg_bench.txt
Running 10s test @ http://localhost:8083/api/articles
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39s   435.69ms   2.00s    78.00%
    Req/Sec    17.57     10.47    50.00     66.79%
  590 requests in 10.06s, 5.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 99
Requests/sec:     58.63
Transfer/sec:    603.37KB